Revit 2027 API
RebarSplice.ConnectedRebarEnd Property
 Identifies the end of the connected rebar which is part of this splice - 0 for start, 1 for end.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ConnectedRebarEnd { get; }
Public ReadOnly Property ConnectedRebarEnd As Integer
	Get
public:
property int ConnectedRebarEnd {
	int get ();
}
member ConnectedRebarEnd : int with get
Property Value
Int32
See Also
Reference
RebarSplice Class
Autodesk.Revit.DB.Structure Namespace